app/Controllers/teachers/Attendance.php

  public function index()
{
    $data['title'] = 'Registro de Presenças';

    $teacherId = $this->session->get('user_id');

    // Get classes for filter
    $data['classes'] = $this->classDisciplineModel
        ->select('tbl_classes.id, tbl_classes.class_name, tbl_classes.class_code')
        ->join('tbl_classes', 'tbl_classes.id = tbl_class_disciplines.class_id')
        ->where('tbl_class_disciplines.teacher_id', $teacherId)
        ->distinct()
        ->findAll();
---
SELECT DISTINCT `tbl_classes`.`id`, `tbl_classes`.`class_name`, `tbl_classes`.`class_code`
FROM `tbl_class_disciplines`
JOIN `tbl_classes` ON `tbl_classes`.`id` = `tbl_class_disciplines`.`class_id`
WHERE `tbl_class_disciplines`.`teacher_id` = '2'

        // Importante: Os alunos podem estar na turma, mas precisamos verificar
        // se a disciplina é ministrada para eles através da tabela class_disciplines

        $data['students'] = $this->enrollmentModel
            ->select('
                tbl_enrollments.id as enrollment_id,
                tbl_students.id,
                tbl_users.first_name,
                tbl_users.last_name,
                tbl_students.student_number
            ')
            ->join('tbl_students', 'tbl_students.id = tbl_enrollments.student_id')
            ->join('tbl_users', 'tbl_users.id = tbl_students.user_id')
            ->where('tbl_enrollments.class_id', $classId)
            ->where('tbl_enrollments.status', 'Ativo')
            ->orderBy('tbl_users.first_name', 'ASC')
            ->findAll();

        // Get existing attendances para esta disciplina específica
        $attendances = $this->attendanceModel
            ->where('class_id', $classId)
            ->where('discipline_id', $disciplineId) // FILTRAR POR DISCIPLINA
            ->where('attendance_date', $date)
            ->findAll();
---
SELECT `tbl_enrollments`.`id` as `enrollment_id`, `tbl_students`.`id`, `tbl_users`.`first_name`, `tbl_users`.`last_name`, `tbl_students`.`student_number`
FROM `tbl_enrollments`
JOIN `tbl_students` ON `tbl_students`.`id` = `tbl_enrollments`.`student_id`
JOIN `tbl_users` ON `tbl_users`.`id` = `tbl_students`.`user_id`
WHERE `tbl_enrollments`.`class_id` = '1'
AND `tbl_enrollments`.`status` = 'Ativo'
ORDER BY `tbl_users`.`first_name` ASC
SELECT *
FROM `tbl_attendance`
WHERE `class_id` = '1'
AND `discipline_id` = '3'
AND `attendance_date` = '2026-02-17'