app/Controllers/teachers/Dashboard.php

SELECT `tbl_class_disciplines`.*, `tbl_classes`.`id` as `class_id`, `tbl_classes`.`class_name`, `tbl_classes`.`class_code`, `tbl_classes`.`class_room`, `tbl_classes`.`class_shift`, `tbl_classes`.`capacity`, `tbl_disciplines`.`id` as `discipline_id`, `tbl_disciplines`.`discipline_name`, `tbl_disciplines`.`discipline_code`
FROM `tbl_class_disciplines`
JOIN `tbl_classes` ON `tbl_classes`.`id` = `tbl_class_disciplines`.`class_id`
JOIN `tbl_disciplines` ON `tbl_disciplines`.`id` = `tbl_class_disciplines`.`discipline_id`
WHERE `tbl_class_disciplines`.`teacher_id` = '2'
AND `tbl_classes`.`is_active` = 1
ORDER BY `tbl_classes`.`class_name` ASC, `tbl_disciplines`.`discipline_name` ASC
SELECT `tbl_exams`.*, `tbl_classes`.`class_name`, `tbl_disciplines`.`discipline_name`
FROM `tbl_exams`
JOIN `tbl_classes` ON `tbl_classes`.`id` = `tbl_exams`.`class_id`
JOIN `tbl_disciplines` ON `tbl_disciplines`.`id` = `tbl_exams`.`discipline_id`
WHERE `tbl_exams`.`created_by` = '2'
AND `tbl_exams`.`exam_date` >= '2026-02-17'
ORDER BY `tbl_exams`.`exam_date` ASC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `tbl_attendance`
WHERE `attendance_date` = '2026-02-17'
---
    public function index()
    {
        $data['title'] = 'Dashboard do Professor';
        $teacherId = $this->session->get('user_id');

        // Get my classes with all needed fields
        $data['myClasses'] = $this->classDisciplineModel
            ->select('
                tbl_class_disciplines.*,
                tbl_classes.id as class_id,
                tbl_classes.class_name,
                tbl_classes.class_code,
                tbl_classes.class_room,
                tbl_classes.class_shift,
                tbl_classes.capacity,
                tbl_disciplines.id as discipline_id,
                tbl_disciplines.discipline_name,
                tbl_disciplines.discipline_code
            ')
            ->join('tbl_classes', 'tbl_classes.id = tbl_class_disciplines.class_id')
            ->join('tbl_disciplines', 'tbl_disciplines.id = tbl_class_disciplines.discipline_id')
            ->where('tbl_class_disciplines.teacher_id', $teacherId)
            ->where('tbl_classes.is_active', 1)
            ->orderBy('tbl_classes.class_name', 'ASC')
            ->orderBy('tbl_disciplines.discipline_name', 'ASC')
            ->findAll();

        // Get upcoming exams
        $data['upcomingExams'] = $this->examModel
            ->select('
                tbl_exams.*,
                tbl_classes.class_name,
                tbl_disciplines.discipline_name
            ')
            ->join('tbl_classes', 'tbl_classes.id = tbl_exams.class_id')
            ->join('tbl_disciplines', 'tbl_disciplines.id = tbl_exams.discipline_id')
            ->where('tbl_exams.created_by', $teacherId)
            ->where('tbl_exams.exam_date >=', date('Y-m-d'))
            ->orderBy('tbl_exams.exam_date', 'ASC')
            ->limit(5)
            ->findAll();

        // Today's attendance count
        $data['todayAttendance'] = $this->attendanceModel
            ->where('attendance_date', date('Y-m-d'))
            ->countAllResults();