app/Controllers/admin/ClassSubjects.php

    $data['totalFiltered'] = $totalAssignments;

    // Filters data
    $data['academicYears'] = $this->academicYearModel->where('is_active', 1)->findAll();

    $data['classes'] = $this->classModel
        ->select('tbl_classes.*, tbl_academic_years.year_name')
        ->join('tbl_academic_years', 'tbl_academic_years.id = tbl_classes.academic_year_id')
        ->where('tbl_classes.is_active', 1)
        ->orderBy('tbl_academic_years.start_date', 'DESC')
        ->orderBy('tbl_classes.class_name', 'ASC')
        ->findAll();

    // NOVO: Buscar cursos para o filtro
    $courseModel = new \App\Models\CourseModel();
    $data['courses'] = $courseModel
        ->where('is_active', 1)
        ->orderBy('course_name', 'ASC')
        ->findAll();

    // NOVO: Buscar disciplinas para o filtro
    $data['disciplines'] = $this->disciplineModel
        ->where('is_active', 1)
        ->orderBy('discipline_name', 'ASC')
        ->findAll();

    // NOVO: Buscar professores para o filtro
    $data['teachers'] = $this->userModel
        ->where('user_type', 'teacher')
        ->where('is_active', 1)
        ->orderBy('first_name', 'ASC')
        ->findAll();
---
SELECT *
FROM `tbl_academic_years`
WHERE `is_active` = 1
SELECT `tbl_classes`.*, `tbl_academic_years`.`year_name`
FROM `tbl_classes`
JOIN `tbl_academic_years` ON `tbl_academic_years`.`id` = `tbl_classes`.`academic_year_id`
WHERE `tbl_classes`.`is_active` = 1
ORDER BY `tbl_academic_years`.`start_date` DESC, `tbl_classes`.`class_name` ASC
SELECT *
FROM `tbl_courses`
WHERE `is_active` = 1
ORDER BY `course_name` ASC
SELECT *
FROM `tbl_disciplines`
WHERE `is_active` = 1
ORDER BY `discipline_name` ASC
SELECT *
FROM `tbl_users`
WHERE `user_type` = 'teacher'
AND `is_active` = 1
ORDER BY `first_name` ASC

    }

    // Buscar todas as turmas ativas para o select
    $data['classes'] = $this->classModel
        ->select('tbl_classes.*, tbl_academic_years.year_name, tbl_grade_levels.level_name, tbl_courses.course_name')
        ->join('tbl_academic_years', 'tbl_academic_years.id = tbl_classes.academic_year_id')
        ->join('tbl_grade_levels', 'tbl_grade_levels.id = tbl_classes.grade_level_id')
        ->join('tbl_courses', 'tbl_courses.id = tbl_classes.course_id', 'left')
        ->where('tbl_classes.is_active', 1)
        ->orderBy('tbl_academic_years.start_date', 'DESC')
        ->orderBy('tbl_classes.class_name', 'ASC')
        ->findAll();

    // Buscar professores
    $data['teachers'] = $this->userModel
        ->where('user_type', 'teacher')
        ->where('is_active', 1)
        ->orderBy('first_name', 'ASC')
        ->findAll();
---
SELECT `tbl_classes`.*, `tbl_academic_years`.`year_name`, `tbl_grade_levels`.`level_name`, `tbl_courses`.`course_name`
FROM `tbl_classes`
JOIN `tbl_academic_years` ON `tbl_academic_years`.`id` = `tbl_classes`.`academic_year_id`
JOIN `tbl_grade_levels` ON `tbl_grade_levels`.`id` = `tbl_classes`.`grade_level_id`
LEFT JOIN `tbl_courses` ON `tbl_courses`.`id` = `tbl_classes`.`course_id`
WHERE `tbl_classes`.`is_active` = 1
ORDER BY `tbl_academic_years`.`start_date` DESC, `tbl_classes`.`class_name` ASC
SELECT *
FROM `tbl_users`
WHERE `user_type` = 'teacher'
AND `is_active` = 1
ORDER BY `first_name` ASC