app/Controllers/admin/ClassSubjects.php

SELECT *
FROM `tbl_semesters`
WHERE `academic_year_id` = '1'
AND `status` IN ('ativo','processado')
ORDER BY `start_date` ASC
---

        if ($data['selectedClassInfo']) {
            // ✅ ADICIONADO: Buscar semestres do ano letivo da turma
            $data['semesters'] = $this->semesterModel
                ->where('academic_year_id', $data['selectedClassInfo']['academic_year_id'])
                ->whereIn('status', ['ativo', 'processado'])
                ->orderBy('start_date', 'ASC')
                ->findAll();

SELECT `id`, `discipline_name`, `discipline_code`, `workload_hours` as `suggested_workload`, "Anual" as `suggested_semester`, 1 as `is_mandatory`
FROM `tbl_disciplines`
WHERE `is_active` = 1
ORDER BY `discipline_name` ASC
---
                    ->findAll();
            } else {
                // Ensino Geral - buscar todas as disciplinas ativas
                $courseDisciplines = $this->disciplineModel
                    ->select('
                        id,
                        discipline_name,
                        discipline_code,
                        workload_hours as suggested_workload,
                        "Anual" as suggested_semester,
                        1 as is_mandatory
                    ')
                    ->where('is_active', 1)
                    ->orderBy('discipline_name', 'ASC')
                    ->findAll();

SELECT `tbl_class_disciplines`.*, `tbl_users`.`first_name` as `teacher_first_name`, `tbl_users`.`last_name` as `teacher_last_name`
FROM `tbl_class_disciplines`
LEFT JOIN `tbl_users` ON `tbl_users`.`id` = `tbl_class_disciplines`.`teacher_id`
WHERE `tbl_class_disciplines`.`class_id` = '4'
AND `tbl_class_disciplines`.`is_active` = 1
---
            ];

            // Buscar atribuições existentes desta turma
            $existingAssignments = $this->classDisciplineModel
                ->select('
                    tbl_class_disciplines.*,
                    tbl_users.first_name as teacher_first_name,
                    tbl_users.last_name as teacher_last_name
                ')
                ->join('tbl_users', 'tbl_users.id = tbl_class_disciplines.teacher_id', 'left')
                ->where('tbl_class_disciplines.class_id', $classId)
                ->where('tbl_class_disciplines.is_active', 1)
                ->findAll();