app/Controllers/admin/Classes.php

            $builder->where('tbl_classes.is_active', 0);
        }

        $data['classes'] = $builder->orderBy('tbl_academic_years.start_date', 'DESC')
            ->orderBy('tbl_classes.class_name', 'ASC')
            ->paginate(10);
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_classes`
JOIN `tbl_grade_levels` ON `tbl_grade_levels`.`id` = `tbl_classes`.`grade_level_id`
JOIN `tbl_academic_years` ON `tbl_academic_years`.`id` = `tbl_classes`.`academic_year_id`
LEFT JOIN `tbl_users` ON `tbl_users`.`id` = `tbl_classes`.`class_teacher_id`
LEFT JOIN `tbl_courses` ON `tbl_courses`.`id` = `tbl_classes`.`course_id`
SELECT `tbl_classes`.*, `tbl_grade_levels`.`level_name`, `tbl_academic_years`.`year_name`, `tbl_users`.`first_name` as `teacher_first_name`, `tbl_users`.`last_name` as `teacher_last_name`, `tbl_courses`.`course_name`, `tbl_courses`.`course_code`, `tbl_courses`.`course_type`
FROM `tbl_classes`
JOIN `tbl_grade_levels` ON `tbl_grade_levels`.`id` = `tbl_classes`.`grade_level_id`
JOIN `tbl_academic_years` ON `tbl_academic_years`.`id` = `tbl_classes`.`academic_year_id`
LEFT JOIN `tbl_users` ON `tbl_users`.`id` = `tbl_classes`.`class_teacher_id`
LEFT JOIN `tbl_courses` ON `tbl_courses`.`id` = `tbl_classes`.`course_id`
ORDER BY `tbl_academic_years`.`start_date` DESC, `tbl_classes`.`class_name` ASC
 LIMIT 10

        $data['pager'] = $this->classModel->pager;

        // Filters
        $data['academicYears'] = $this->academicYearModel->findAll();
---
SELECT *
FROM `tbl_academic_years`