app/Controllers/admin/Clients.php

    $data['selectedStatus'] = $status;

    // Dados para filtros
    $data['academicYears'] = $this->academicYearModel->where('is_active', 1)->findAll();
    $data['classes'] = $this->classModel
        ->select('tbl_classes.*, tbl_academic_years.year_name')
        ->join('tbl_academic_years', 'tbl_academic_years.id = tbl_classes.academic_year_id')
        ->where('tbl_classes.is_active', 1)
        ->orderBy('tbl_academic_years.start_date', 'DESC')
        ->orderBy('tbl_classes.class_name', 'ASC')
        ->findAll();
---
SELECT *
FROM `tbl_academic_years`
WHERE `is_active` = 1
SELECT `tbl_classes`.*, `tbl_academic_years`.`year_name`
FROM `tbl_classes`
JOIN `tbl_academic_years` ON `tbl_academic_years`.`id` = `tbl_classes`.`academic_year_id`
WHERE `tbl_classes`.`is_active` = 1
ORDER BY `tbl_academic_years`.`start_date` DESC, `tbl_classes`.`class_name` ASC