app/Controllers/admin/Clients.php

SELECT COUNT(*) AS `numrows` FROM `tbl_students`
---
    }

    // Buscar alunos paginados
    $data['students'] = $builder->orderBy('tbl_users.first_name', 'ASC')
        ->paginate(10);

SELECT COUNT(*) AS `numrows` FROM `tbl_students`
SELECT COUNT(*) AS `numrows`
FROM `tbl_enrollments`
WHERE `status` = 'Ativo'
SELECT COUNT(*) AS `numrows`
FROM `tbl_enrollments`
WHERE `status` = 'Pendente'
SELECT `student_id`
FROM `tbl_enrollments`
WHERE `status` IN ('Ativo','Pendente')
---
    $data['courses'] = $this->courseModel->getActive();

    // Estatísticas
    $data['totalStudents'] = $this->studentModel->countAll();
    $data['enrolledStudents'] = $this->enrollmentModel->where('status', 'Ativo')->countAllResults();
    $data['pendingEnrollments'] = $this->enrollmentModel->where('status', 'Pendente')->countAllResults();

    // CORREÇÃO AQUI: Verificar se há IDs antes de usar whereNotIn
    $enrolledStudents = $this->enrollmentModel
        ->select('student_id')
        ->whereIn('status', ['Ativo', 'Pendente'])
        ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `tbl_students`
WHERE `id` NOT IN ('1','2','3')
SELECT COUNT(*) AS `numrows`
FROM `tbl_students`
SELECT COUNT(*) AS `numrows`
FROM `tbl_students`
WHERE `gender` = 'Masculino'
SELECT COUNT(*) AS `numrows`
FROM `tbl_students`
WHERE `gender` = 'Feminino'
---
    $enrolledIds = array_column($enrolledStudents, 'student_id');

    if (!empty($enrolledIds)) {
        $data['nonEnrolledStudents'] = $this->studentModel
            ->whereNotIn('id', $enrolledIds)
            ->countAllResults();
    } else {
        // Se não há alunos matriculados, todos os alunos são não matriculados
        $data['nonEnrolledStudents'] = $this->studentModel->countAllResults();
    }

    $data['maleCount'] = $this->studentModel->where('gender', 'Masculino')->countAllResults();
    $data['femaleCount'] = $this->studentModel->where('gender', 'Feminino')->countAllResults();

SELECT *
FROM `tbl_academic_years`
WHERE `is_active` = 1
ORDER BY `start_date` DESC
SELECT *
FROM `tbl_grade_levels`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC
---
public function studentForm($id = null)
{
    $data['title'] = $id ? 'Editar Aluno' : 'Novo Aluno';
    $data['student'] = $id ? $this->studentModel->getWithUser($id) : null;

    // Obter ano letivo atual
    $currentYear = $this->academicYearModel->getCurrent();
    $data['currentYear'] = $currentYear;

    // Anos letivos ativos
    $data['academicYears'] = $this->academicYearModel
        ->where('is_active', 1)
        ->orderBy('start_date', 'DESC')
        ->findAll();

    // Níveis de ensino
    $gradeLevelModel = new \App\Models\GradeLevelModel();
    $data['gradeLevels'] = $gradeLevelModel
        ->where('is_active', 1)
        ->orderBy('sort_order', 'ASC')
        ->findAll();

SELECT *
FROM `tbl_enrollments`
WHERE `student_id` = '6'
AND `academic_year_id` = '1'
AND `status` = 'Pendente'
ORDER BY `created_at` DESC
 LIMIT 1
---

    if ($id && $data['student']) {
        // Buscar matrícula pendente primeiro
        $enrollment = $this->enrollmentModel
            ->where('student_id', $id)
            ->where('academic_year_id', $currentYear->id ?? 0)
            ->where('status', 'Pendente')
            ->orderBy('created_at', 'DESC')
            ->first();

SELECT *
FROM `tbl_enrollments`
WHERE `student_id` = '6'
AND `status` = 'Ativo'
ORDER BY `id` DESC
 LIMIT 1
---
            $data['selectedPreviousGrade'] = $enrollment->previous_grade_id;
        } else {
            // Se não tem pendente, buscar matrícula ativa
            $activeEnrollment = $this->enrollmentModel
                ->where('student_id', $id)
                ->where('status', 'Ativo')
                ->orderBy('id', 'DESC')
                ->first();