app/Controllers/admin/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_students`
WHERE `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `tbl_users`
WHERE `user_type` = 'staff'
AND `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `tbl_enrollments`
WHERE `academic_year_id` = '1'
AND `status` = 'Ativo'
---
    public function index()
    {
        $data['title'] = 'Dashboard';

        // ===== ESTATÍSTICAS PRINCIPAIS =====
        $data['totalStudents'] = $this->studentModel->where('is_active', 1)->countAllResults();
        $data['totalTeachers'] = $this->userModel->where('user_type', 'teacher')->where('is_active', 1)->countAllResults();
        $data['totalStaff'] = $this->userModel->where('user_type', 'staff')->where('is_active', 1)->countAllResults();

        // ===== MATRÍCULAS =====
        $currentYear = $this->academicYearModel->getCurrent();
        $data['currentYear'] = $currentYear;

        if ($currentYear) {
            $data['activeEnrollments'] = $this->enrollmentModel
                ->where('academic_year_id', $currentYear->id)
                ->where('status', 'Ativo')
                ->countAllResults();