app/Controllers/admin/Enrollments.php

public function index()
{
    // Verificar permissão
    if (!$this->hasPermission('view_enrollments')) {
        return redirect()->to('/admin/dashboard')->with('error', 'Não tem permissão para ver matrículas');
    }

    $data['title'] = 'Matrículas';

    // Capturar filtros
    $academicYearId = $this->request->getGet('academic_year');
    $gradeLevelId = $this->request->getGet('grade_level');
    $classId = $this->request->getGet('class_id');
    $status = $this->request->getGet('status');
    $courseId = $this->request->getGet('course');

    // Obter ano letivo atual
    $currentYear = $this->academicYearModel->getCurrent();
    $currentYearId = $currentYear ? $currentYear->id : null;

    $builder = $this->enrollmentModel
        ->select('
            tbl_enrollments.*,
            tbl_users.first_name,
            tbl_users.last_name,
            tbl_students.student_number,
            tbl_classes.class_name,
            tbl_classes.class_shift,
            tbl_grade_levels.level_name,
            tbl_academic_years.year_name,
            tbl_courses.id as course_id,
            tbl_courses.course_name,
            tbl_courses.course_code,
            tbl_courses.course_type
        ')
        ->join('tbl_students', 'tbl_students.id = tbl_enrollments.student_id')
        ->join('tbl_users', 'tbl_users.id = tbl_students.user_id')
        ->join('tbl_classes', 'tbl_classes.id = tbl_enrollments.class_id', 'left')
        ->join('tbl_grade_levels', 'tbl_grade_levels.id = tbl_enrollments.grade_level_id', 'left')
        ->join('tbl_academic_years', 'tbl_academic_years.id = tbl_enrollments.academic_year_id')
        ->join('tbl_courses', 'tbl_courses.id = tbl_enrollments.course_id', 'left');
---
SELECT `tbl_enrollments`.*, `tbl_users`.`first_name`, `tbl_users`.`last_name`, `tbl_students`.`student_number`, `tbl_classes`.`class_name`, `tbl_classes`.`class_shift`, `tbl_grade_levels`.`level_name`, `tbl_academic_years`.`year_name`
FROM `tbl_enrollments`
JOIN `tbl_students` ON `tbl_students`.`id` = `tbl_enrollments`.`student_id`
JOIN `tbl_users` ON `tbl_users`.`id` = `tbl_students`.`user_id`
LEFT JOIN `tbl_classes` ON `tbl_classes`.`id` = `tbl_enrollments`.`class_id`
LEFT JOIN `tbl_grade_levels` ON `tbl_grade_levels`.`id` = `tbl_enrollments`.`grade_level_id`
JOIN `tbl_academic_years` ON `tbl_academic_years`.`id` = `tbl_enrollments`.`academic_year_id`
ORDER BY `tbl_enrollments`.`created_at` DESC
 LIMIT 10

    $data['totalFiltered'] = $builder->countAllResults(false);

    // Dados para filtros
    $data['academicYears'] = $this->academicYearModel->where('is_active', 1)->findAll();
    $data['gradeLevels'] = (new \App\Models\GradeLevelModel())->where('is_active', 1)->orderBy('sort_order', 'ASC')->findAll();
---
SELECT *
FROM `tbl_academic_years`
WHERE `is_active` = 1
SELECT *
FROM `tbl_grade_levels`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC

    $data['courses'] = $this->courseModel->getHighSchoolCourses();
    $data['selectedCourse'] = $courseId;

    $data['classes'] = $this->classModel
        ->select('tbl_classes.*, tbl_academic_years.year_name')
        ->join('tbl_academic_years', 'tbl_academic_years.id = tbl_classes.academic_year_id')
        ->where('tbl_classes.is_active', 1)
        ->orderBy('tbl_academic_years.start_date', 'DESC')
        ->orderBy('tbl_classes.class_name', 'ASC')
        ->findAll();


    // Estatísticas
    $data['totalEnrollments'] = $this->enrollmentModel->countAll();
    $data['activeEnrollments'] = $this->enrollmentModel->where('status', 'Ativo')->countAllResults();
    $data['pendingEnrollments'] = $this->enrollmentModel->where('status', 'Pendente')->countAllResults();
    $data['completedEnrollments'] = $this->enrollmentModel->where('status', 'Concluído')->countAllResults();
---
SELECT `tbl_classes`.*, `tbl_academic_years`.`year_name`
FROM `tbl_classes`
JOIN `tbl_academic_years` ON `tbl_academic_years`.`id` = `tbl_classes`.`academic_year_id`
WHERE `tbl_classes`.`is_active` = 1
ORDER BY `tbl_academic_years`.`start_date` DESC, `tbl_classes`.`class_name` ASC
SELECT COUNT(*) AS `numrows` FROM `tbl_enrollments`
SELECT COUNT(*) AS `numrows`
FROM `tbl_enrollments`
WHERE `status` = 'Ativo'
SELECT COUNT(*) AS `numrows`
FROM `tbl_enrollments`
WHERE `status` = 'Pendente'
SELECT COUNT(*) AS `numrows`
FROM `tbl_enrollments`
WHERE `status` = 'Concluído'