app/Controllers/admin/Enrollments.php

        $builder->where('tbl_enrollments.status', $status);
    }

    $data['enrollments'] = $builder->orderBy('tbl_enrollments.created_at', 'DESC')
        ->paginate(10);
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_enrollments`

    $data['totalFiltered'] = $builder->countAllResults(false);

    // Dados para filtros
    $data['academicYears'] = $this->academicYearModel->where('is_active', 1)->findAll();
    $data['gradeLevels'] = (new \App\Models\GradeLevelModel())->where('is_active', 1)->orderBy('sort_order', 'ASC')->findAll();
    $data['classes'] = $this->classModel
        ->select('tbl_classes.*, tbl_academic_years.year_name')
        ->join('tbl_academic_years', 'tbl_academic_years.id = tbl_classes.academic_year_id')
        ->where('tbl_classes.is_active', 1)
        ->orderBy('tbl_academic_years.start_date', 'DESC')
        ->orderBy('tbl_classes.class_name', 'ASC')
        ->findAll();

    // Estatísticas
    $data['totalEnrollments'] = $this->enrollmentModel->countAll();
    $data['activeEnrollments'] = $this->enrollmentModel->where('status', 'Ativo')->countAllResults();
    $data['pendingEnrollments'] = $this->enrollmentModel->where('status', 'Pendente')->countAllResults();
    $data['completedEnrollments'] = $this->enrollmentModel->where('status', 'Concluído')->countAllResults();
---
SELECT *
FROM `tbl_academic_years`
WHERE `is_active` = 1
SELECT *
FROM `tbl_grade_levels`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC
SELECT `tbl_classes`.*, `tbl_academic_years`.`year_name`
FROM `tbl_classes`
JOIN `tbl_academic_years` ON `tbl_academic_years`.`id` = `tbl_classes`.`academic_year_id`
WHERE `tbl_classes`.`is_active` = 1
ORDER BY `tbl_academic_years`.`start_date` DESC, `tbl_classes`.`class_name` ASC
SELECT COUNT(*) AS `numrows` FROM `tbl_enrollments`
SELECT COUNT(*) AS `numrows`
FROM `tbl_enrollments`
WHERE `status` = 'Ativo'
SELECT COUNT(*) AS `numrows`
FROM `tbl_enrollments`
WHERE `status` = 'Pendente'
SELECT COUNT(*) AS `numrows`
FROM `tbl_enrollments`
WHERE `status` = 'Concluído'

public function form($id = null)
{
    // Verificar permissão específica baseada na ação
    if ($id) {
        // Editando matrícula existente
        if (!$this->hasPermission('edit_enrollments')) {
            return redirect()->to('/admin/students/enrollments')->with('error', 'Não tem permissão para editar matrículas');
        }
    } else {
        // Criando nova matrícula
        if (!$this->hasPermission('create_enrollments')) {
            return redirect()->to('/admin/students/enrollments')->with('error', 'Não tem permissão para criar matrículas');
        }
    }

    $data['title'] = $id ? 'Editar Matrícula' : 'Nova Matrícula';
    $data['enrollment'] = $id ? $this->enrollmentModel->getWithDetails($id) : null;

    $currentYear = $this->academicYearModel->getCurrent();

    // Verificar se existe ano letivo atual
    if (!$currentYear) {
        return redirect()->to('/admin/academic/years')
            ->with('error', 'É necessário definir um ano letivo atual antes de fazer matrículas.');
    }

    // Buscar alunos ativos
    $data['students'] = $this->studentModel
        ->select('tbl_students.id, tbl_users.first_name, tbl_users.last_name, tbl_students.student_number')
        ->join('tbl_users', 'tbl_users.id = tbl_students.user_id')
        ->where('tbl_students.is_active', 1)
        ->orderBy('tbl_users.first_name', 'ASC')
        ->findAll();

    // Buscar níveis de ensino
    $gradeLevelModel = new \App\Models\GradeLevelModel();
    $data['gradeLevels'] = $gradeLevelModel
        ->where('is_active', 1)
        ->orderBy('sort_order', 'ASC')
        ->findAll();

    // Buscar anos letivos ativos
    $data['academicYears'] = $this->academicYearModel
        ->where('is_active', 1)
        ->orderBy('start_date', 'DESC')
        ->findAll();
---
SELECT `tbl_students`.`id`, `tbl_users`.`first_name`, `tbl_users`.`last_name`, `tbl_students`.`student_number`
FROM `tbl_students`
JOIN `tbl_users` ON `tbl_users`.`id` = `tbl_students`.`user_id`
WHERE `tbl_students`.`is_active` = 1
ORDER BY `tbl_users`.`first_name` ASC
SELECT *
FROM `tbl_grade_levels`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC
SELECT *
FROM `tbl_academic_years`
WHERE `is_active` = 1
ORDER BY `start_date` DESC