app/Controllers/admin/ExamPeriods.php

    public function index()
    {
        $data['title'] = 'Períodos de Exame';

        // Buscar ano letivo da URL ou usar o ano corrente
        $academicYearId = $this->request->getGet('academic_year');

        // Se não veio da URL, usar o ano corrente
        if (empty($academicYearId)) {
            $academicYearId = current_academic_year();
        }

        $data['periods'] = $this->examPeriodModel->getActivePeriods($academicYearId);
        $data['academicYears'] = $this->academicYearModel->where('is_active', 1)->findAll();
---
SELECT *
FROM `tbl_academic_years`
WHERE `is_active` = 1