app/Controllers/admin/GradeWeights.php

        $data['groupedWeights'] = $groupedWeights;

        // Get filter data
        $data['academicYears'] = $this->academicYearModel->where('is_active', 1)->findAll();
        $data['gradeLevels'] = $this->gradeLevelModel->where('is_active', 1)->orderBy('sort_order', 'ASC')->findAll();
---
SELECT *
FROM `tbl_academic_years`
WHERE `is_active` = 1
SELECT *
FROM `tbl_grade_levels`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC