app/Controllers/admin/Logs.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_user_logs`
LEFT JOIN `tbl_users` ON `tbl_users`.`id` = `tbl_user_logs`.`user_id`
WHERE `tbl_user_logs`.`user_id` = '1'
SELECT `tbl_user_logs`.*, `tbl_users`.`username`, `tbl_users`.`first_name`, `tbl_users`.`last_name`, `tbl_users`.`photo`
FROM `tbl_user_logs`
LEFT JOIN `tbl_users` ON `tbl_users`.`id` = `tbl_user_logs`.`user_id`
WHERE `tbl_user_logs`.`user_id` = '1'
ORDER BY `tbl_user_logs`.`created_at` DESC
 LIMIT 50
---
    public function index()
    {
        $data['title'] = 'Logs do Sistema';

        // Get filters
        $userId = $this->request->getGet('user_id');
        $action = $this->request->getGet('action');
        $startDate = $this->request->getGet('start_date');
        $endDate = $this->request->getGet('end_date');

        $builder = $this->userLogModel
            ->select('tbl_user_logs.*, tbl_users.username, tbl_users.first_name, tbl_users.last_name, tbl_users.photo')
            ->join('tbl_users', 'tbl_users.id = tbl_user_logs.user_id', 'left');

        if ($userId) {
            $builder->where('tbl_user_logs.user_id', $userId);
        }

        if ($action) {
            $builder->where('tbl_user_logs.action', $action);
        }

        if ($startDate) {
            $builder->where('tbl_user_logs.created_at >=', $startDate . ' 00:00:00');
        }

        if ($endDate) {
            $builder->where('tbl_user_logs.created_at <=', $endDate . ' 23:59:59');
        }

        $data['logs'] = $builder->orderBy('tbl_user_logs.created_at', 'DESC')
            ->paginate(50);

SELECT `id`, `username`, `first_name`, `last_name`
FROM `tbl_users`
WHERE `is_active` = 1
ORDER BY `first_name` ASC
---
        $data['pager'] = $this->userLogModel->pager;

        // Get users for filter
        $data['users'] = $this->userModel
            ->select('id, username, first_name, last_name')
            ->where('is_active', 1)
            ->orderBy('first_name', 'ASC')
            ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `tbl_user_logs`
WHERE DATE(created_at) = '2026-02-19'
SELECT COUNT(*) AS `numrows`
FROM `tbl_user_logs`
WHERE `created_at` >= '2026-02-12'
SELECT COUNT(*) AS `numrows`
FROM `tbl_user_logs`
WHERE `created_at` >= '2026-02-01'
---
        $data['actions'] = get_user_actions(); // Usando o helper

        // Summary statistics
        $data['totalToday'] = $this->userLogModel
            ->where('DATE(created_at)', date('Y-m-d'))
            ->countAllResults();

        $data['totalWeek'] = $this->userLogModel
            ->where('created_at >=', date('Y-m-d', strtotime('-7 days')))
            ->countAllResults();

        $data['totalMonth'] = $this->userLogModel
            ->where('created_at >=', date('Y-m-01'))
            ->countAllResults();