app/Controllers/admin/Semesters.php

SELECT `tbl_semesters`.*, `tbl_academic_years`.`year_name`
FROM `tbl_semesters`
JOIN `tbl_academic_years` ON `tbl_academic_years`.`id` = `tbl_semesters`.`academic_year_id`
ORDER BY `tbl_academic_years`.`start_date` DESC, `tbl_semesters`.`start_date` ASC
---
public function index()
{
    $data['title'] = 'Semestres/Trimestres';

    // Filters
    $academicYearId = $this->request->getGet('academic_year');
    $status = $this->request->getGet('status');

    $builder = $this->semesterModel
        ->select('tbl_semesters.*, tbl_academic_years.year_name')
        ->join('tbl_academic_years', 'tbl_academic_years.id = tbl_semesters.academic_year_id');

    if ($academicYearId) {
        $builder->where('tbl_semesters.academic_year_id', $academicYearId);
    }

    // Filtrar por status do semestre (ativo/inativo/concluido)
    if ($status && in_array($status, ['ativo', 'inativo', 'processado', 'concluido'])) {
        $builder->where('tbl_semesters.status', $status);
    } elseif ($status == 'active') {
        $builder->where('tbl_semesters.is_active', 1);
    } elseif ($status == 'inactive') {
        $builder->where('tbl_semesters.is_active', 0);
    }

    $semesters = $builder->orderBy('tbl_academic_years.start_date', 'DESC')
        ->orderBy('tbl_semesters.start_date', 'ASC')
        ->findAll();

SELECT `semester_id`, COUNT(*) as total
FROM `tbl_semester_results`
WHERE `semester_id` IN ('1','2','3')
GROUP BY `semester_id`
---
    $statsData = [];
    if (!empty($semesterIds)) {
        // Resultados processados
        $resultsCounts = $db->table('tbl_semester_results')
            ->select('semester_id, COUNT(*) as total')
            ->whereIn('semester_id', $semesterIds)
            ->groupBy('semester_id')
            ->get()
            ->getResultArray();

SELECT `ep`.`semester_id`, COUNT(*) as total
FROM `tbl_exam_schedules` `es`
JOIN `tbl_exam_periods` `ep` ON `ep`.`id` = `es`.`exam_period_id`
WHERE `ep`.`semester_id` IN ('1','2','3')
GROUP BY `ep`.`semester_id`
---
        }

        // Total de exames
        $examsCounts = $db->table('tbl_exam_schedules es')
            ->select('ep.semester_id, COUNT(*) as total')
            ->join('tbl_exam_periods ep', 'ep.id = es.exam_period_id')
            ->whereIn('ep.semester_id', $semesterIds)
            ->groupBy('ep.semester_id')
            ->get()
            ->getResultArray();

SELECT *
FROM `tbl_academic_years`
WHERE `is_active` = 1
---
    }

    $data['semesters'] = $semesters;
    $data['academicYears'] = $this->academicYearModel->where('is_active', 1)->findAll();

SELECT `tbl_semesters`.*, `tbl_academic_years`.`year_name`
FROM `tbl_semesters`
JOIN `tbl_academic_years` ON `tbl_academic_years`.`id` = `tbl_semesters`.`academic_year_id`
WHERE `tbl_semesters`.`id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `tbl_exam_schedules` `es`
JOIN `tbl_exam_periods` `ep` ON `ep`.`id` = `es`.`exam_period_id`
WHERE `ep`.`semester_id` = '1'
SELECT COUNT(DISTINCT e.id) as total
FROM `tbl_enrollments` `e`
JOIN `tbl_classes` `c` ON `c`.`id` = `e`.`class_id`
JOIN `tbl_class_disciplines` `cd` ON `cd`.`class_id` = `c`.`id`
JOIN `tbl_semesters` `s` ON `s`.`id` = `cd`.`semester_id`
WHERE `s`.`id` = '1'
AND `e`.`status` = 'Ativo'
---
public function info($semesterId)
{
    if (!$this->request->isAJAX()) {
        return $this->response->setJSON(['success' => false, 'message' => 'Requisição inválida']);
    }

    $semester = $this->semesterModel
        ->select('tbl_semesters.*, tbl_academic_years.year_name')
        ->join('tbl_academic_years', 'tbl_academic_years.id = tbl_semesters.academic_year_id')
        ->find($semesterId);

    if (!$semester) {
        return $this->response->setJSON([
            'success' => false,
            'message' => 'Semestre não encontrado'
        ]);
    }

    // Buscar estatísticas
    $db = db_connect();

    // 1. Total de exames no semestre
    $totalExams = $db->table('tbl_exam_schedules es')
        ->join('tbl_exam_periods ep', 'ep.id = es.exam_period_id')
        ->where('ep.semester_id', $semesterId)
        ->countAllResults();

    // 2. Total de alunos ÚNICOS matriculados (CORRIGIDO)
    $query = $db->table('tbl_enrollments e')
        ->select('COUNT(DISTINCT e.id) as total')
        ->join('tbl_classes c', 'c.id = e.class_id')
        ->join('tbl_class_disciplines cd', 'cd.class_id = c.id')
        ->join('tbl_semesters s', 's.id = cd.semester_id')
        ->where('s.id', $semesterId)
        ->where('e.status', 'Ativo')
        ->get();

SELECT COUNT(*) AS `numrows`
FROM `tbl_semester_results`
WHERE `semester_id` = '1'
SELECT COUNT(DISTINCT es.discipline_id) as total
FROM `tbl_exam_results` `er`
JOIN `tbl_exam_schedules` `es` ON `es`.`id` = `er`.`exam_schedule_id`
JOIN `tbl_exam_periods` `ep` ON `ep`.`id` = `es`.`exam_period_id`
WHERE `ep`.`semester_id` = '1'
---
    $totalStudents = $query->getRow()->total;

    // 3. Resultados já processados
    $totalResults = $db->table('tbl_semester_results')
        ->where('semester_id', $semesterId)
        ->countAllResults();

    // 4. Total de disciplinas com notas lançadas
    $disciplinesWithGrades = $db->table('tbl_exam_results er')
        ->join('tbl_exam_schedules es', 'es.id = er.exam_schedule_id')
        ->join('tbl_exam_periods ep', 'ep.id = es.exam_period_id')
        ->where('ep.semester_id', $semesterId)
        ->select('COUNT(DISTINCT es.discipline_id) as total')
        ->get()
        ->getRow()
        ->total;

SELECT *
FROM `tbl_semesters`
WHERE `tbl_semesters`.`id` = '1'
---
public function process()
{
    // Verificar se é AJAX
    if (!$this->request->isAJAX()) {
        return $this->response->setJSON([
            'success' => false,
            'message' => 'Requisição inválida'
        ]);
    }

    $semesterId = $this->request->getPost('semester_id');
    $generateReportCards = (bool) $this->request->getPost('generate_report_cards');
    $closeSemester = (bool) $this->request->getPost('close_semester');

    if (!$semesterId) {
        return $this->response->setJSON([
            'success' => false,
            'message' => 'ID do semestre não fornecido.'
        ]);
    }

    // Verificar se o semestre existe
    $semester = $this->semesterModel->find($semesterId);

SELECT COUNT(*) AS `numrows`
FROM `tbl_exam_results` `er`
JOIN `tbl_exam_schedules` `es` ON `es`.`id` = `er`.`exam_schedule_id`
JOIN `tbl_exam_periods` `ep` ON `ep`.`id` = `es`.`exam_period_id`
WHERE `ep`.`semester_id` = '1'
---
    $db = db_connect();

    // Verificar se existem notas para processar
    $hasGrades = $db->table('tbl_exam_results er')
        ->join('tbl_exam_schedules es', 'es.id = er.exam_schedule_id')
        ->join('tbl_exam_periods ep', 'ep.id = es.exam_period_id')
        ->where('ep.semester_id', $semesterId)
        ->countAllResults();

UPDATE `tbl_semesters` SET `status` = 'processado', `updated_at` = '2026-02-21 20:29:22'
WHERE `tbl_semesters`.`id` IN ('1')
---
        }

        // ATUALIZAR STATUS DO SEMESTRE PARA "processado"
        $this->semesterModel->update($semesterId, [
            'status' => 'processado'
        ]);

SELECT *
FROM `tbl_semester_results`
WHERE `semester_id` = '1'
SELECT *
FROM `tbl_report_cards`
WHERE `enrollment_id` = '1'
AND `semester_id` = '1'
---
private function generateReportCards($semesterId)
{
    $reportCardModel = new \App\Models\ReportCardModel();

    // Buscar todos os resultados do semestre
    $db = db_connect();
    $results = $db->table('tbl_semester_results')
        ->where('semester_id', $semesterId)
        ->get()
        ->getResult();

    $count = 0;
    foreach ($results as $result) {
        try {
            // Verificar se já existe boletim
            $existing = $db->table('tbl_report_cards')
                ->where('enrollment_id', $result->enrollment_id)
                ->where('semester_id', $semesterId)
                ->get()
                ->getRow();