app/Controllers/admin/SemesterResults.php

public function index()
{
    $data['title'] = 'Resultados Semestrais';

    // Get current semester
    $currentSemester = $this->semesterModel->getCurrent();
    $semesterId = $this->request->getGet('semester') ?: ($currentSemester['id'] ?? null);

    // Get filters
    $classId = $this->request->getGet('class_id');

    $data['semesters'] = $this->semesterModel->getActive();
    $data['classes'] = $this->classModel->where('is_active', 1)->findAll();

    $data['selectedSemester'] = $semesterId;
    $data['selectedClass'] = $classId;

    // Get summary statistics
    $data['totalResults'] = $this->semesterResultModel->countAll();
    $data['resultsThisSemester'] = $semesterId ?
        $this->semesterResultModel->where('semester_id', $semesterId)->countAllResults() : 0;

    // Get recent results
    $builder = $this->semesterResultModel
        ->select('
            tbl_semester_results.*,
            tbl_users.first_name,
            tbl_users.last_name,
            tbl_students.student_number,
            tbl_classes.class_name,
            tbl_semesters.semester_name
        ')
        ->join('tbl_enrollments', 'tbl_enrollments.id = tbl_semester_results.enrollment_id')
        ->join('tbl_students', 'tbl_students.id = tbl_enrollments.student_id')
        ->join('tbl_users', 'tbl_users.id = tbl_students.user_id')
        ->join('tbl_classes', 'tbl_classes.id = tbl_enrollments.class_id')
        ->join('tbl_semesters', 'tbl_semesters.id = tbl_semester_results.semester_id');
---
SELECT *
FROM `tbl_classes`
WHERE `is_active` = 1
SELECT COUNT(*) AS `numrows` FROM `tbl_semester_results`
SELECT COUNT(*) AS `numrows`
FROM `tbl_semester_results`
WHERE `semester_id` = '2'
SELECT `tbl_semester_results`.*, `tbl_users`.`first_name`, `tbl_users`.`last_name`, `tbl_students`.`student_number`, `tbl_classes`.`class_name`, `tbl_semesters`.`semester_name`
FROM `tbl_semester_results`
JOIN `tbl_enrollments` ON `tbl_enrollments`.`id` = `tbl_semester_results`.`enrollment_id`
JOIN `tbl_students` ON `tbl_students`.`id` = `tbl_enrollments`.`student_id`
JOIN `tbl_users` ON `tbl_users`.`id` = `tbl_students`.`user_id`
JOIN `tbl_classes` ON `tbl_classes`.`id` = `tbl_enrollments`.`class_id`
JOIN `tbl_semesters` ON `tbl_semesters`.`id` = `tbl_semester_results`.`semester_id`
WHERE `tbl_semester_results`.`semester_id` = '2'
ORDER BY `tbl_semester_results`.`id` DESC
 LIMIT 20