app/Controllers/admin/Users.php

    public function profile()
    {
        $data['title'] = 'Meu Perfil';
        $data['user'] = $this->userModel->find($this->session->get('user_id'));
---
SELECT *
FROM `tbl_users`
WHERE `tbl_users`.`id` = '1'