app/Views/teachers/layouts/sidebar.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_documents`
WHERE `user_id` = 2
AND `user_type` = 'teacher'
AND `is_verified` = 0
AND `tbl_documents`.`deleted_at` IS NULL
---
                <i class="fas fa-folder-open"></i> Documentos
                <?php
                $documentModel = new \App\Models\DocumentModel();
                $pendingDocs = $documentModel->where('user_id', currentUserId())
                    ->where('user_type', 'teacher')
                    ->where('is_verified', 0)
                    ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_document_requests`
WHERE `user_id` = 2
AND `user_type` = 'teacher'
AND `status` = 'pending'
---
                        <i class="fas fa-file-signature"></i> Solicitar Documento
                        <?php
                        $requestModel = new \App\Models\DocumentRequestModel();
                        $pendingRequests = $requestModel->where('user_id', currentUserId())
                            ->where('user_type', 'teacher')
                            ->where('status', 'pending')
                            ->countAllResults();