app/Helpers/auth_helper.php

SELECT `id`
FROM `tbl_students`
WHERE `user_id` = 2
---
    function getStudentIdFromUser(?int $userId = null): ?int
    {
        $userId = $userId ?? currentUserId();
        if (!$userId) {
            return null;
        }

        $db = db_connect();
        $student = $db->table('tbl_students')
            ->select('id')
            ->where('user_id', $userId)
            ->get()
            ->getRow();