app/Helpers/student_helper.php

SELECT `tbl_enrollments`.*, `tbl_classes`.`class_name`, `tbl_classes`.`class_shift`, `tbl_classes`.`grade_level_id`, `tbl_grade_levels`.`level_name`, `tbl_academic_years`.`year_name`
FROM `tbl_enrollments`
LEFT JOIN `tbl_classes` ON `tbl_classes`.`id` = `tbl_enrollments`.`class_id`
LEFT JOIN `tbl_grade_levels` ON `tbl_grade_levels`.`id` = `tbl_classes`.`grade_level_id`
LEFT JOIN `tbl_academic_years` ON `tbl_academic_years`.`id` = `tbl_enrollments`.`academic_year_id`
WHERE `tbl_enrollments`.`student_id` = 1
AND `tbl_enrollments`.`status` IN ('Ativo','Pendente')
ORDER BY `tbl_enrollments`.`created_at` DESC
 LIMIT 1
---
    function getStudentCurrentEnrollment($studentId) {
        $enrollmentModel = new EnrollmentModel();
        return $enrollmentModel
            ->select('
                tbl_enrollments.*,
                tbl_classes.class_name,
                tbl_classes.class_shift,
                tbl_classes.grade_level_id,
                tbl_grade_levels.level_name,
                tbl_academic_years.year_name
            ')
            ->join('tbl_classes', 'tbl_classes.id = tbl_enrollments.class_id', 'left')
            ->join('tbl_grade_levels', 'tbl_grade_levels.id = tbl_classes.grade_level_id', 'left')
            ->join('tbl_academic_years', 'tbl_academic_years.id = tbl_enrollments.academic_year_id', 'left')
            ->where('tbl_enrollments.student_id', $studentId)
            ->whereIn('tbl_enrollments.status', ['Ativo', 'Pendente'])
            ->orderBy('tbl_enrollments.created_at', 'DESC')
            ->first();

SELECT *
FROM `tbl_enrollments`
WHERE `tbl_enrollments`.`id` = '1'
SELECT `tbl_exam_schedules`.*, `tbl_disciplines`.`discipline_name`, `tbl_disciplines`.`discipline_code`, `tbl_exam_boards`.`board_name`, `tbl_exam_boards`.`board_type`, `tbl_exam_boards`.`weight`, `tbl_exam_periods`.`period_name`, DATE_FORMAT(tbl_exam_schedules.exam_date, "%d/%m/%Y") as formatted_date, DATE_FORMAT(tbl_exam_schedules.exam_time, "%H:%i") as formatted_time
FROM `tbl_exam_schedules`
JOIN `tbl_disciplines` ON `tbl_disciplines`.`id` = `tbl_exam_schedules`.`discipline_id`
JOIN `tbl_exam_boards` ON `tbl_exam_boards`.`id` = `tbl_exam_schedules`.`exam_board_id`
JOIN `tbl_exam_periods` ON `tbl_exam_periods`.`id` = `tbl_exam_schedules`.`exam_period_id`
WHERE `tbl_exam_schedules`.`class_id` = '1'
AND `tbl_exam_schedules`.`exam_date` >= '2026-02-22'
ORDER BY `tbl_exam_schedules`.`exam_date` ASC, `tbl_exam_schedules`.`exam_time` ASC
 LIMIT 1
---
    function getStudentExams($enrollmentId, $limit = null) {
        $examScheduleModel = new ExamScheduleModel();

        // Primeiro buscar a matrícula para pegar a class_id
        $enrollmentModel = new EnrollmentModel();
        $enrollment = $enrollmentModel->find($enrollmentId);

        if (!$enrollment || !$enrollment->class_id) {
            return [];
        }

        $builder = $examScheduleModel
            ->select('
                tbl_exam_schedules.*,
                tbl_disciplines.discipline_name,
                tbl_disciplines.discipline_code,
                tbl_exam_boards.board_name,
                tbl_exam_boards.board_type,
                tbl_exam_boards.weight,
                tbl_exam_periods.period_name,
                DATE_FORMAT(tbl_exam_schedules.exam_date, "%d/%m/%Y") as formatted_date,
                DATE_FORMAT(tbl_exam_schedules.exam_time, "%H:%i") as formatted_time
            ')
            ->join('tbl_disciplines', 'tbl_disciplines.id = tbl_exam_schedules.discipline_id')
            ->join('tbl_exam_boards', 'tbl_exam_boards.id = tbl_exam_schedules.exam_board_id')
            ->join('tbl_exam_periods', 'tbl_exam_periods.id = tbl_exam_schedules.exam_period_id')
            ->where('tbl_exam_schedules.class_id', $enrollment->class_id)
            ->where('tbl_exam_schedules.exam_date >=', date('Y-m-d'));

SELECT `tbl_exam_results`.*, `tbl_exam_schedules`.`discipline_id`, `tbl_exam_schedules`.`exam_date`, `tbl_exam_schedules`.`max_score`, `tbl_exam_schedules`.`approval_score`, `tbl_disciplines`.`discipline_name`, `tbl_disciplines`.`discipline_code`, `tbl_exam_boards`.`board_name`, `tbl_exam_boards`.`board_type`, `tbl_exam_boards`.`weight`, `tbl_exam_periods`.`period_name`, `tbl_exam_periods`.`semester_id`, DATE_FORMAT(tbl_exam_schedules.exam_date, "%d/%m/%Y") as formatted_date
FROM `tbl_exam_results`
JOIN `tbl_exam_schedules` ON `tbl_exam_schedules`.`id` = `tbl_exam_results`.`exam_schedule_id`
JOIN `tbl_disciplines` ON `tbl_disciplines`.`id` = `tbl_exam_schedules`.`discipline_id`
JOIN `tbl_exam_boards` ON `tbl_exam_boards`.`id` = `tbl_exam_schedules`.`exam_board_id`
JOIN `tbl_exam_periods` ON `tbl_exam_periods`.`id` = `tbl_exam_schedules`.`exam_period_id`
WHERE `tbl_exam_results`.`enrollment_id` = '1'
ORDER BY `tbl_exam_schedules`.`exam_date` DESC
---
    function getStudentGrades($enrollmentId, $semesterId = null) {
        $examResultModel = new ExamResultModel();

        $builder = $examResultModel
            ->select('
                tbl_exam_results.*,
                tbl_exam_schedules.discipline_id,
                tbl_exam_schedules.exam_date,
                tbl_exam_schedules.max_score,
                tbl_exam_schedules.approval_score,
                tbl_disciplines.discipline_name,
                tbl_disciplines.discipline_code,
                tbl_exam_boards.board_name,
                tbl_exam_boards.board_type,
                tbl_exam_boards.weight,
                tbl_exam_periods.period_name,
                tbl_exam_periods.semester_id,
                DATE_FORMAT(tbl_exam_schedules.exam_date, "%d/%m/%Y") as formatted_date
            ')
            ->join('tbl_exam_schedules', 'tbl_exam_schedules.id = tbl_exam_results.exam_schedule_id')
            ->join('tbl_disciplines', 'tbl_disciplines.id = tbl_exam_schedules.discipline_id')
            ->join('tbl_exam_boards', 'tbl_exam_boards.id = tbl_exam_schedules.exam_board_id')
            ->join('tbl_exam_periods', 'tbl_exam_periods.id = tbl_exam_schedules.exam_period_id')
            ->where('tbl_exam_results.enrollment_id', $enrollmentId);

        if ($semesterId) {
            $builder->where('tbl_exam_periods.semester_id', $semesterId);
        }

        return $builder->orderBy('tbl_exam_schedules.exam_date', 'DESC')
            ->findAll();

SELECT `tbl_attendance`.`discipline_id`, `tbl_disciplines`.`discipline_name`, COUNT(*) as total, SUM(CASE WHEN tbl_attendance.status IN ("Presente", "Atrasado", "Falta Justificada") THEN 1 ELSE 0 END) as present
FROM `tbl_attendance`
LEFT JOIN `tbl_disciplines` ON `tbl_disciplines`.`id` = `tbl_attendance`.`discipline_id`
WHERE `tbl_attendance`.`enrollment_id` = '1'
GROUP BY `tbl_attendance`.`discipline_id`
---
    function getStudentAttendanceStats($enrollmentId, $semesterId = null) {
        $attendanceModel = new AttendanceModel();

        $builder = $attendanceModel
            ->select('
                tbl_attendance.discipline_id,
                tbl_disciplines.discipline_name,
                COUNT(*) as total,
                SUM(CASE WHEN tbl_attendance.status IN ("Presente", "Atrasado", "Falta Justificada") THEN 1 ELSE 0 END) as present
            ')
            ->join('tbl_disciplines', 'tbl_disciplines.id = tbl_attendance.discipline_id', 'left')
            ->where('tbl_attendance.enrollment_id', $enrollmentId);

        if ($semesterId) {
            $builder->where('tbl_attendance.semester_id', $semesterId);
        }

        $results = $builder->groupBy('tbl_attendance.discipline_id')
            ->findAll();

SELECT `tbl_disciplines`.`id`, `tbl_disciplines`.`discipline_name`, `tbl_disciplines`.`discipline_code`, `tbl_disciplines`.`workload_hours`, `tbl_disciplines`.`approval_grade`, `tbl_class_disciplines`.`teacher_id`, `tbl_users`.`first_name` as `teacher_first_name`, `tbl_users`.`last_name` as `teacher_last_name`, CONCAT(tbl_users.first_name, " ", tbl_users.last_name) as teacher_name
FROM `tbl_class_disciplines`
JOIN `tbl_disciplines` ON `tbl_disciplines`.`id` = `tbl_class_disciplines`.`discipline_id`
LEFT JOIN `tbl_users` ON `tbl_users`.`id` = `tbl_class_disciplines`.`teacher_id`
WHERE `tbl_class_disciplines`.`class_id` = '1'
AND `tbl_class_disciplines`.`is_active` = 1
ORDER BY `tbl_disciplines`.`discipline_name` ASC
---
    function getStudentDisciplines($studentId = null) {
        if (!$studentId && isStudent()) {
            $studentId = getStudentIdFromUser();
        }

        if (!$studentId) {
            return [];
        }

        $enrollment = getStudentCurrentEnrollment($studentId);

        if (!$enrollment || !$enrollment->class_id) {
            return [];
        }

        $classDisciplineModel = new \App\Models\ClassDisciplineModel();

        $disciplines = $classDisciplineModel
            ->select('
                tbl_disciplines.id,
                tbl_disciplines.discipline_name,
                tbl_disciplines.discipline_code,
                tbl_disciplines.workload_hours,
                tbl_disciplines.approval_grade,
                tbl_class_disciplines.teacher_id,
                tbl_users.first_name as teacher_first_name,
                tbl_users.last_name as teacher_last_name,
                CONCAT(tbl_users.first_name, " ", tbl_users.last_name) as teacher_name
            ')
            ->join('tbl_disciplines', 'tbl_disciplines.id = tbl_class_disciplines.discipline_id')
            ->join('tbl_users', 'tbl_users.id = tbl_class_disciplines.teacher_id', 'left')
            ->where('tbl_class_disciplines.class_id', $enrollment->class_id)
            ->where('tbl_class_disciplines.is_active', 1)
            ->orderBy('tbl_disciplines.discipline_name', 'ASC')
            ->findAll();

SELECT *
FROM `tbl_discipline_averages`
WHERE `enrollment_id` = '1'
AND `discipline_id` = '12'
ORDER BY `semester_id` DESC
 LIMIT 1
---

            // Média final da disciplina
            $averageModel = new DisciplineAverageModel();
            $finalAverage = $averageModel
                ->where('enrollment_id', $enrollment->id)
                ->where('discipline_id', $discipline->id)
                ->orderBy('semester_id', 'DESC')
                ->first();

SELECT COUNT(*) AS `numrows`
FROM `tbl_attendance`
WHERE `enrollment_id` = '1'
---
    function getStudentAttendancePercentage($studentId = null, $precision = 1)
    {
        if (!$studentId && isStudent()) {
            $studentId = getStudentIdFromUser();
        }

        if (!$studentId) {
            return '0%';
        }

        $enrollment = getStudentCurrentEnrollment($studentId);

        if (!$enrollment) {
            return '0%';
        }

        $attendanceModel = new AttendanceModel();

        $total = $attendanceModel
            ->where('enrollment_id', $enrollment->id)
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_student_fees`
WHERE `enrollment_id` = '1'
AND `status` IN ('Pendente','Vencido')
---
    function getStudentPendingFeesCount($studentId = null)
    {
        if (!$studentId && isStudent()) {
            $studentId = getStudentIdFromUser();
        }

        if (!$studentId) {
            return '0 pendente(s)';
        }

        $enrollment = getStudentCurrentEnrollment($studentId);

        if (!$enrollment) {
            return '0 pendente(s)';
        }

        $feeModel = new StudentFeeModel();

        $pendingCount = $feeModel
            ->where('enrollment_id', $enrollment->id)
            ->whereIn('status', ['Pendente', 'Vencido'])
            ->countAllResults();