app/Controllers/students/Attendance.php

SELECT *
FROM `tbl_semesters`
WHERE `is_current` = 1
 LIMIT 1
SELECT `tbl_attendance`.*, `tbl_disciplines`.`discipline_name`, DATE_FORMAT(attendance_date, "%d/%m/%Y") as formatted_date
FROM `tbl_attendance`
LEFT JOIN `tbl_disciplines` ON `tbl_disciplines`.`id` = `tbl_attendance`.`discipline_id`
WHERE `tbl_attendance`.`enrollment_id` = '1'
AND `tbl_attendance`.`attendance_date` >= '2026-05-01'
AND `tbl_attendance`.`attendance_date` <= '2026-05-31'
ORDER BY `tbl_attendance`.`attendance_date` DESC
---
    public function index()
    {
        $data['title'] = 'Minhas Presenças';

        $studentId = getStudentIdFromUser();
        $enrollment = getStudentCurrentEnrollment($studentId);

        if (!$enrollment) {
            return redirect()->to('/students/dashboard')
                ->with('error', 'Nenhuma matrícula ativa encontrada');
        }

        $month = $this->request->getGet('month') ?: date('m');
        $year = $this->request->getGet('year') ?: date('Y');

        $startDate = "$year-$month-01";
        $endDate = date('Y-m-t', strtotime($startDate));

        // Buscar semestre atual para filtrar
        $currentSemester = $this->semesterModel->where('is_current', 1)->first();
        $semesterId = $currentSemester ? $currentSemester['id'] : null;

        // Presenças do mês
        $data['attendances'] = $this->attendanceModel
            ->select('
                tbl_attendance.*,
                tbl_disciplines.discipline_name,
                DATE_FORMAT(attendance_date, "%d/%m/%Y") as formatted_date
            ')
            ->join('tbl_disciplines', 'tbl_disciplines.id = tbl_attendance.discipline_id', 'left')
            ->where('tbl_attendance.enrollment_id', $enrollment['id'])
            ->where('tbl_attendance.attendance_date >=', $startDate)
            ->where('tbl_attendance.attendance_date <=', $endDate)
            ->orderBy('tbl_attendance.attendance_date', 'DESC')
            ->findAll();