app/Controllers/students/Dashboard.php

SELECT `tbl_exam_schedules`.*, `tbl_disciplines`.`discipline_name`, `tbl_exam_boards`.`board_type`, `tbl_exam_boards`.`board_name`, DATE_FORMAT(exam_date, "%d/%m/%Y") as formatted_date, DATE_FORMAT(exam_time, "%H:%i") as formatted_time
FROM `tbl_exam_schedules`
JOIN `tbl_disciplines` ON `tbl_disciplines`.`id` = `tbl_exam_schedules`.`discipline_id`
JOIN `tbl_exam_boards` ON `tbl_exam_boards`.`id` = `tbl_exam_schedules`.`exam_board_id`
WHERE `tbl_exam_schedules`.`class_id` = '1'
AND `tbl_exam_schedules`.`exam_date` >= '2026-02-22'
ORDER BY `tbl_exam_schedules`.`exam_date` ASC
 LIMIT 5
SELECT `tbl_exam_results`.*, `tbl_exam_schedules`.`discipline_id`, `tbl_disciplines`.`discipline_name`, `tbl_exam_boards`.`board_type`, `tbl_exam_schedules`.`exam_date`
FROM `tbl_exam_results`
JOIN `tbl_exam_schedules` ON `tbl_exam_schedules`.`id` = `tbl_exam_results`.`exam_schedule_id`
JOIN `tbl_disciplines` ON `tbl_disciplines`.`id` = `tbl_exam_schedules`.`discipline_id`
JOIN `tbl_exam_boards` ON `tbl_exam_boards`.`id` = `tbl_exam_schedules`.`exam_board_id`
WHERE `tbl_exam_results`.`enrollment_id` = '1'
ORDER BY `tbl_exam_results`.`recorded_at` DESC
 LIMIT 5
---
    public function index()
    {
        $data['title'] = 'Dashboard do Aluno';

        $userId = currentUserId();
        $studentId = getStudentIdFromUser();
        $enrollmentId = getStudentEnrollmentId($studentId);

        if (!$studentId) {
            return redirect()->to('/auth/logout')->with('error', 'Perfil de aluno não encontrado');
        }

        // Buscar dados do aluno
        $student = $this->studentModel->getByUserId($userId);
        $data['student'] = $student;

        // Buscar matrícula atual
        $data['enrollment'] = $this->enrollmentModel->getCurrentForStudent($studentId);

        if ($data['enrollment']) {
            // Próximos exames
            $data['upcomingExams'] = $this->examScheduleModel
                ->select('
                    tbl_exam_schedules.*,
                    tbl_disciplines.discipline_name,
                    tbl_exam_boards.board_type,
                    tbl_exam_boards.board_name,
                    DATE_FORMAT(exam_date, "%d/%m/%Y") as formatted_date,
                    DATE_FORMAT(exam_time, "%H:%i") as formatted_time
                ')
                ->join('tbl_disciplines', 'tbl_disciplines.id = tbl_exam_schedules.discipline_id')
                ->join('tbl_exam_boards', 'tbl_exam_boards.id = tbl_exam_schedules.exam_board_id')
                ->where('tbl_exam_schedules.class_id', $data['enrollment']->class_id)
                ->where('tbl_exam_schedules.exam_date >=', date('Y-m-d'))
                ->orderBy('tbl_exam_schedules.exam_date', 'ASC')
                ->limit(5)
                ->findAll();

            // Notas recentes
            $recentResults = $this->examResultModel
                ->select('
                    tbl_exam_results.*,
                    tbl_exam_schedules.discipline_id,
                    tbl_disciplines.discipline_name,
                    tbl_exam_boards.board_type,
                    tbl_exam_schedules.exam_date
                ')
                ->join('tbl_exam_schedules', 'tbl_exam_schedules.id = tbl_exam_results.exam_schedule_id')
                ->join('tbl_disciplines', 'tbl_disciplines.id = tbl_exam_schedules.discipline_id')
                ->join('tbl_exam_boards', 'tbl_exam_boards.id = tbl_exam_schedules.exam_board_id')
                ->where('tbl_exam_results.enrollment_id', $data['enrollment']->id)
                ->orderBy('tbl_exam_results.recorded_at', 'DESC')
                ->limit(5)
                ->findAll();

SELECT `tbl_student_fees`.*, `tbl_fee_types`.`type_name`
FROM `tbl_student_fees`
JOIN `tbl_fee_structure` ON `tbl_fee_structure`.`id` = `tbl_student_fees`.`fee_structure_id`
JOIN `tbl_fee_types` ON `tbl_fee_types`.`id` = `tbl_fee_structure`.`fee_type_id`
WHERE `tbl_student_fees`.`enrollment_id` = '1'
AND `tbl_student_fees`.`status` IN ('Pendente','Vencido')
ORDER BY `tbl_student_fees`.`due_date` ASC
SELECT COUNT(*) as total, SUM(CASE WHEN status IN ("Presente", "Atrasado", "Falta Justificada") THEN 1 ELSE 0 END) as present
FROM `tbl_attendance`
WHERE `enrollment_id` = '1'
AND `attendance_date` >= '2026-02-01'
AND `attendance_date` <= '2026-02-28'
 LIMIT 1
---
            }

            // Propinas pendentes
            $data['pendingFees'] = $this->studentFeeModel
                ->select('
                    tbl_student_fees.*,
                    tbl_fee_types.type_name
                ')
                ->join('tbl_fee_structure', 'tbl_fee_structure.id = tbl_student_fees.fee_structure_id')
                ->join('tbl_fee_types', 'tbl_fee_types.id = tbl_fee_structure.fee_type_id')
                ->where('tbl_student_fees.enrollment_id', $data['enrollment']->id)
                ->whereIn('tbl_student_fees.status', ['Pendente', 'Vencido'])
                ->orderBy('tbl_student_fees.due_date', 'ASC')
                ->findAll();

            // Presenças do mês atual - AGORA COMO OBJETO
            $attendanceStats = $this->attendanceModel
                ->select('
                    COUNT(*) as total,
                    SUM(CASE WHEN status IN ("Presente", "Atrasado", "Falta Justificada") THEN 1 ELSE 0 END) as present
                ')
                ->where('enrollment_id', $data['enrollment']->id)
                ->where('attendance_date >=', date('Y-m-01'))
                ->where('attendance_date <=', date('Y-m-t'))
                ->first();

SELECT SUM(total_amount) as total
FROM `tbl_student_fees`
WHERE `enrollment_id` = '1'
 LIMIT 1
SELECT SUM(amount_paid) as total
FROM `tbl_fee_payments`
JOIN `tbl_student_fees` ON `tbl_student_fees`.`id` = `tbl_fee_payments`.`student_fee_id`
WHERE `tbl_student_fees`.`enrollment_id` = '1'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `tbl_student_fees`
WHERE `enrollment_id` = '1'
AND `status` IN ('Pendente','Vencido')
---
    private function getFinancialSummary($enrollmentId)
    {
        // Total devido
        $totalDue = $this->studentFeeModel
            ->select('SUM(total_amount) as total')
            ->where('enrollment_id', $enrollmentId)
            ->first();

        // Total pago
        $totalPaid = $this->feePaymentModel
            ->select('SUM(amount_paid) as total')
            ->join('tbl_student_fees', 'tbl_student_fees.id = tbl_fee_payments.student_fee_id')
            ->where('tbl_student_fees.enrollment_id', $enrollmentId)
            ->first();

        // Pendências
        $pending = $this->studentFeeModel
            ->where('enrollment_id', $enrollmentId)
            ->whereIn('status', ['Pendente', 'Vencido'])
            ->countAllResults();