app/Controllers/students/Exams.php

    public function index()
    {
        $data['title'] = 'Meus Exames';

        $studentId = getStudentIdFromUser();
        $enrollment = getStudentCurrentEnrollment($studentId);

        if (!$enrollment) {
            return redirect()->to('/students/dashboard')
                ->with('error', 'Nenhuma matrícula ativa encontrada');
        }

        // Próximos exames
        $data['upcomingExams'] = $this->examScheduleModel
            ->select('
                tbl_exam_schedules.*,
                tbl_disciplines.discipline_name,
                tbl_exam_boards.board_name,
                tbl_exam_boards.board_type,
                tbl_exam_periods.period_name
            ')
            ->join('tbl_disciplines', 'tbl_disciplines.id = tbl_exam_schedules.discipline_id')
            ->join('tbl_exam_boards', 'tbl_exam_boards.id = tbl_exam_schedules.exam_board_id')
            ->join('tbl_exam_periods', 'tbl_exam_periods.id = tbl_exam_schedules.exam_period_id')
            ->where('tbl_exam_schedules.class_id', $enrollment['class_id'])
            ->where('tbl_exam_schedules.exam_date >=', date('Y-m-d'))
            ->orderBy('tbl_exam_schedules.exam_date', 'ASC')
            ->orderBy('tbl_exam_schedules.exam_time', 'ASC')
            ->findAll();

        // Exames passados
        $data['pastExams'] = $this->examScheduleModel
            ->select('
                tbl_exam_schedules.*,
                tbl_disciplines.discipline_name,
                tbl_exam_boards.board_name,
                tbl_exam_boards.board_type,
                tbl_exam_periods.period_name
            ')
            ->join('tbl_disciplines', 'tbl_disciplines.id = tbl_exam_schedules.discipline_id')
            ->join('tbl_exam_boards', 'tbl_exam_boards.id = tbl_exam_schedules.exam_board_id')
            ->join('tbl_exam_periods', 'tbl_exam_periods.id = tbl_exam_schedules.exam_period_id')
            ->where('tbl_exam_schedules.class_id', $enrollment['class_id'])
            ->where('tbl_exam_schedules.exam_date <', date('Y-m-d'))
            ->orderBy('tbl_exam_schedules.exam_date', 'DESC')
            ->findAll();
---
SELECT `tbl_exams`.*, `tbl_disciplines`.`discipline_name`, `tbl_exam_boards`.`board_name`
FROM `tbl_exams`
JOIN `tbl_disciplines` ON `tbl_disciplines`.`id` = `tbl_exams`.`discipline_id`
JOIN `tbl_exam_boards` ON `tbl_exam_boards`.`id` = `tbl_exams`.`exam_board_id`
WHERE `tbl_exams`.`class_id` = '1'
AND `tbl_exams`.`exam_date` >= '2026-02-17'
ORDER BY `tbl_exams`.`exam_date` ASC, `tbl_exams`.`exam_time` ASC
SELECT `tbl_exams`.*, `tbl_disciplines`.`discipline_name`, `tbl_exam_boards`.`board_name`
FROM `tbl_exams`
JOIN `tbl_disciplines` ON `tbl_disciplines`.`id` = `tbl_exams`.`discipline_id`
JOIN `tbl_exam_boards` ON `tbl_exam_boards`.`id` = `tbl_exams`.`exam_board_id`
WHERE `tbl_exams`.`class_id` = '1'
AND `tbl_exams`.`exam_date` < '2026-02-17'
ORDER BY `tbl_exams`.`exam_date` DESC

    public function schedule()
    {
        $data['title'] = 'Calendário de Exames';

        $studentId = getStudentIdFromUser();
        $enrollment = getStudentCurrentEnrollment($studentId);

        if (!$enrollment) {
            return redirect()->to('/students/dashboard')
                ->with('error', 'Nenhuma matrícula ativa encontrada');
        }

        $month = $this->request->getGet('month') ?: date('m');
        $year = $this->request->getGet('year') ?: date('Y');

        $startDate = "$year-$month-01";
        $endDate = date('Y-m-t', strtotime($startDate));

        // Buscar exames do mês
        $data['exams'] = $this->examScheduleModel
            ->select('
                tbl_exam_schedules.*,
                tbl_disciplines.discipline_name,
                tbl_exam_boards.board_name,
                tbl_exam_boards.board_type,
                DATE_FORMAT(exam_date, "%d/%m/%Y") as formatted_date,
                DATE_FORMAT(exam_time, "%H:%i") as formatted_time
            ')
            ->join('tbl_disciplines', 'tbl_disciplines.id = tbl_exam_schedules.discipline_id')
            ->join('tbl_exam_boards', 'tbl_exam_boards.id = tbl_exam_schedules.exam_board_id')
            ->where('tbl_exam_schedules.class_id', $enrollment['class_id'])
            ->where('tbl_exam_schedules.exam_date >=', $startDate)
            ->where('tbl_exam_schedules.exam_date <=', $endDate)
            ->orderBy('tbl_exam_schedules.exam_date', 'ASC')
            ->orderBy('tbl_exam_schedules.exam_time', 'ASC')
            ->findAll();
---
SELECT `tbl_exams`.*, `tbl_disciplines`.`discipline_name`, `tbl_exam_boards`.`board_name`
FROM `tbl_exams`
JOIN `tbl_disciplines` ON `tbl_disciplines`.`id` = `tbl_exams`.`discipline_id`
JOIN `tbl_exam_boards` ON `tbl_exam_boards`.`id` = `tbl_exams`.`exam_board_id`
WHERE `tbl_exams`.`class_id` = '1'
AND `tbl_exams`.`exam_date` >= '2026-02-01'
AND `tbl_exams`.`exam_date` <= '2026-02-28'
ORDER BY `tbl_exams`.`exam_date` ASC, `tbl_exams`.`exam_time` ASC