app/Controllers/students/Profile.php

SELECT *
FROM `tbl_users`
WHERE `tbl_users`.`id` = 2
---
    public function index()
    {
        $data['title'] = 'Meu Perfil';

        $userId = currentUserId();
        $studentId = getStudentIdFromUser();

        if (!$studentId) {
            return redirect()->to('/students/dashboard')->with('error', 'Perfil de aluno não encontrado');
        }

        // Buscar dados do aluno com usuário
        $data['student'] = $this->studentModel->getWithUser($studentId);

        // Buscar dados do usuário
        $data['user'] = $this->userModel->find($userId);

SELECT COUNT(*) AS `numrows`
FROM `tbl_class_disciplines`
WHERE `class_id` = '1'
AND `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `tbl_attendance`
WHERE `enrollment_id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `tbl_attendance`
WHERE `enrollment_id` = '1'
AND `status` IN ('Presente','Atrasado','Falta Justificada')
---
    private function getStudentStats($studentId)
    {
        // Contar disciplinas
        $enrollment = $this->enrollmentModel->getCurrentForStudent($studentId);
        $disciplines = 0;

        if ($enrollment) {
            $classDisciplineModel = new \App\Models\ClassDisciplineModel();
            $disciplines = $classDisciplineModel
                ->where('class_id', $enrollment['class_id'])
                ->where('is_active', 1)
                ->countAllResults();
        }

        // Contar presenças
        $attendanceModel = new \App\Models\AttendanceModel();
        $totalAttendance = 0;
        $presentAttendance = 0;
        $attendanceRate = 0;

        if ($enrollment) {
            $totalAttendance = $attendanceModel
                ->where('enrollment_id', $enrollment['id'])
                ->countAllResults();

            $presentAttendance = $attendanceModel
                ->where('enrollment_id', $enrollment['id'])
                ->whereIn('status', ['Presente', 'Atrasado', 'Falta Justificada'])
                ->countAllResults();