app/Models/AcademicYearModel.php

SELECT *
FROM `tbl_academic_years`
WHERE `is_current` = 1
AND `is_active` = 1
 LIMIT 1
---
    public function getCurrent()
    {
        $current = $this->where('is_current', 1)
            ->where('is_active', 1)
            ->first();