app/Models/CourseModel.php

    public function getActive()
    {
        return $this->where('is_active', 1)
            ->orderBy('course_name', 'ASC')
            ->findAll();
---
SELECT *
FROM `tbl_courses`
WHERE `is_active` = 1
ORDER BY `course_name` ASC

    public function getHighSchoolCourses()
    {
        return $this->where('start_grade_id >=', 13) // 10ª classe é ID 13
            ->where('is_active', 1)
            ->orderBy('course_name', 'ASC')
            ->findAll();
---
SELECT *
FROM `tbl_courses`
WHERE `start_grade_id` >= 13
AND `is_active` = 1
ORDER BY `course_name` ASC