app/Models/EnrollmentModel.php

SELECT `tbl_enrollments`.*, `tbl_classes`.`class_name`, `tbl_classes`.`class_code`, `tbl_classes`.`class_shift`, `tbl_academic_years`.`year_name`
FROM `tbl_enrollments`
JOIN `tbl_classes` ON `tbl_classes`.`id` = `tbl_enrollments`.`class_id`
JOIN `tbl_academic_years` ON `tbl_academic_years`.`id` = `tbl_enrollments`.`academic_year_id`
WHERE `tbl_enrollments`.`student_id` = 1
AND `tbl_enrollments`.`status` = 'Ativo'
ORDER BY `tbl_enrollments`.`id` DESC
 LIMIT 1
---
    public function getCurrentForStudent($studentId)
    {
        return $this->select('
                tbl_enrollments.*,
                tbl_classes.class_name,
                tbl_classes.class_code,
                tbl_classes.class_shift,
                tbl_academic_years.year_name
            ')
            ->join('tbl_classes', 'tbl_classes.id = tbl_enrollments.class_id')
            ->join('tbl_academic_years', 'tbl_academic_years.id = tbl_enrollments.academic_year_id')
            ->where('tbl_enrollments.student_id', $studentId)
            ->where('tbl_enrollments.status', 'Ativo')
            ->orderBy('tbl_enrollments.id', 'DESC')
            ->first();