app/Models/ExamResultModel.php

SELECT `tbl_exam_results`.*, `tbl_exams`.`exam_name`, `tbl_exams`.`exam_date`, `tbl_disciplines`.`discipline_name`, `tbl_exam_boards`.`board_name`, `tbl_exam_boards`.`board_type`
FROM `tbl_exam_results`
JOIN `tbl_exams` ON `tbl_exams`.`id` = `tbl_exam_results`.`exam_id`
JOIN `tbl_disciplines` ON `tbl_disciplines`.`id` = `tbl_exams`.`discipline_id`
JOIN `tbl_exam_boards` ON `tbl_exam_boards`.`id` = `tbl_exams`.`exam_board_id`
JOIN `tbl_enrollments` ON `tbl_enrollments`.`id` = `tbl_exam_results`.`enrollment_id`
WHERE `tbl_enrollments`.`student_id` = '1'
ORDER BY `tbl_exams`.`exam_date` DESC
---
    public function getStudentResults($studentId, $semesterId = null)
    {
        $builder = $this->select('
                tbl_exam_results.*,
                tbl_exams.exam_name,
                tbl_exams.exam_date,
                tbl_disciplines.discipline_name,
                tbl_exam_boards.board_name,
                tbl_exam_boards.board_type
            ')
            ->join('tbl_exams', 'tbl_exams.id = tbl_exam_results.exam_id')
            ->join('tbl_disciplines', 'tbl_disciplines.id = tbl_exams.discipline_id')
            ->join('tbl_exam_boards', 'tbl_exam_boards.id = tbl_exams.exam_board_id')
            ->join('tbl_enrollments', 'tbl_enrollments.id = tbl_exam_results.enrollment_id')
            ->where('tbl_enrollments.student_id', $studentId);

        if ($semesterId) {
            $builder->where('tbl_exams.semester_id', $semesterId);
        }

        return $builder->orderBy('tbl_exams.exam_date', 'DESC')
            ->findAll();