app/Models/FinalGradeModel.php

SELECT `tbl_final_grades`.*, `tbl_disciplines`.`discipline_name`, `tbl_disciplines`.`workload_hours`
FROM `tbl_final_grades`
JOIN `tbl_enrollments` ON `tbl_enrollments`.`id` = `tbl_final_grades`.`enrollment_id`
JOIN `tbl_disciplines` ON `tbl_disciplines`.`id` = `tbl_final_grades`.`discipline_id`
WHERE `tbl_enrollments`.`student_id` = '1'
AND `tbl_final_grades`.`semester_id` IS NULL
ORDER BY `tbl_disciplines`.`discipline_name` ASC
---
    public function getReportCard($studentId, $semesterId)
    {
        return $this->select('
                tbl_final_grades.*,
                tbl_disciplines.discipline_name,
                tbl_disciplines.workload_hours
            ')
            ->join('tbl_enrollments', 'tbl_enrollments.id = tbl_final_grades.enrollment_id')
            ->join('tbl_disciplines', 'tbl_disciplines.id = tbl_final_grades.discipline_id')
            ->where('tbl_enrollments.student_id', $studentId)
            ->where('tbl_final_grades.semester_id', $semesterId)
            ->orderBy('tbl_disciplines.discipline_name', 'ASC')
            ->findAll();