app/Models/GradeLevelModel.php

    public function getActive()
    {
        return $this->where('is_active', 1)
            ->orderBy('sort_order', 'ASC')
            ->findAll();
---
SELECT *
FROM `tbl_grade_levels`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC