app/Models/GuardianModel.php

    public function getByStudent($studentId)
    {
        return $this->select('tbl_guardians.*, tbl_student_guardians.relationship, tbl_student_guardians.is_authorized')
            ->join('tbl_student_guardians', 'tbl_student_guardians.guardian_id = tbl_guardians.id')
            ->where('tbl_student_guardians.student_id', $studentId)
            ->where('tbl_guardians.is_active', 1)
            ->orderBy('tbl_guardians.is_primary', 'DESC')
            ->findAll();
---
SELECT `tbl_guardians`.*, `tbl_student_guardians`.`relationship`, `tbl_student_guardians`.`is_authorized`
FROM `tbl_guardians`
JOIN `tbl_student_guardians` ON `tbl_student_guardians`.`guardian_id` = `tbl_guardians`.`id`
WHERE `tbl_student_guardians`.`student_id` = '6'
AND `tbl_guardians`.`is_active` = 1
ORDER BY `tbl_guardians`.`is_primary` DESC