app/Models/NotificationModel.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_notifications`
WHERE `user_id` = '2'
AND `is_read` = 0
AND `expires_at` > '2026-02-22 12:36:51'
OR `expires_at` IS NULL
---
    public function getUnreadCount($userId)
    {
        return $this->where('user_id', $userId)
            ->where('is_read', 0)
            ->where('expires_at >', date('Y-m-d H:i:s'))
            ->orWhere('expires_at IS NULL')
            ->countAllResults();

SELECT *
FROM `tbl_notifications`
WHERE `user_id` = '2'
AND `expires_at` > '2026-02-22 12:36:51'
OR `expires_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function getRecent($userId, $limit = 10)
    {
        return $this->where('user_id', $userId)
            ->where('expires_at >', date('Y-m-d H:i:s'))
            ->orWhere('expires_at IS NULL')
            ->orderBy('created_at', 'DESC')
            ->limit($limit)
            ->findAll();