app/Models/SchoolEventModel.php

SELECT `tbl_school_events`.*, `tbl_users`.`first_name`, `tbl_users`.`last_name`
FROM `tbl_school_events`
LEFT JOIN `tbl_users` ON `tbl_users`.`id` = `tbl_school_events`.`created_by`
WHERE `start_date` >= '2026-01-26T00:00:00+01:00'
AND `start_date` <= '2026-03-09T00:00:00+01:00'
AND `academic_year_id` = '2'
ORDER BY `start_date` ASC, `start_time` ASC
---
    public function getForCalendar($startDate, $endDate, $academicYearId = null)
    {
        $builder = $this->select('
                tbl_school_events.*,
                tbl_users.first_name,
                tbl_users.last_name
            ')
            ->join('tbl_users', 'tbl_users.id = tbl_school_events.created_by', 'left')
            ->where('start_date >=', $startDate)
            ->where('start_date <=', $endDate);

        if ($academicYearId) {
            $builder->where('academic_year_id', $academicYearId);
        }

        return $builder->orderBy('start_date', 'ASC')
            ->orderBy('start_time', 'ASC')
            ->findAll();