app/Models/SemesterModel.php

    public function getCurrent()
    {
        return $this->where('is_current', 1)
            ->where('is_active', 1)
            ->first();
---
SELECT *
FROM `tbl_semesters`
WHERE `is_current` = 1
AND `is_active` = 1
 LIMIT 1

    public function getActive()
    {
        $academicYearModel = new AcademicYearModel();
        $currentYear = $academicYearModel->getCurrent();

        if (!$currentYear) {
            return [];
        }

        return $this->where('academic_year_id', $currentYear->id)
            ->where('is_active', 1)
            ->orderBy('start_date', 'ASC')
            ->findAll();
---
SELECT *
FROM `tbl_semesters`
WHERE `academic_year_id` = '1'
AND `is_active` = 1
ORDER BY `start_date` ASC