app/Models/SettingsModel.php

    public function getAll()
    {
        $settings = $this->findAll();
---
SELECT *
FROM `tbl_settings`