app/Models/StudentModel.php

    public function getByUserId($userId)
    {
        return $this->where('user_id', $userId)->first();
---
SELECT *
FROM `tbl_students`
WHERE `user_id` = 2
 LIMIT 1

    public function getCurrentEnrollment($studentId)
    {
        $enrollmentModel = new \App\Models\EnrollmentModel();

        return $enrollmentModel->select('
                tbl_enrollments.*,
                tbl_classes.class_name,
                tbl_classes.class_code,
                tbl_classes.class_shift,
                tbl_academic_years.year_name,
                tbl_academic_years.start_date as year_start,
                tbl_academic_years.end_date as year_end
            ')
            ->join('tbl_classes', 'tbl_classes.id = tbl_enrollments.class_id')
            ->join('tbl_academic_years', 'tbl_academic_years.id = tbl_enrollments.academic_year_id')
            ->where('tbl_enrollments.student_id', $studentId)
            ->where('tbl_enrollments.status', 'Ativo')
            ->orderBy('tbl_enrollments.id', 'DESC')
            ->first();
---
SELECT `tbl_enrollments`.*, `tbl_classes`.`class_name`, `tbl_classes`.`class_code`, `tbl_classes`.`class_shift`, `tbl_academic_years`.`year_name`, `tbl_academic_years`.`start_date` as `year_start`, `tbl_academic_years`.`end_date` as `year_end`
FROM `tbl_enrollments`
JOIN `tbl_classes` ON `tbl_classes`.`id` = `tbl_enrollments`.`class_id`
JOIN `tbl_academic_years` ON `tbl_academic_years`.`id` = `tbl_enrollments`.`academic_year_id`
WHERE `tbl_enrollments`.`student_id` = '1'
AND `tbl_enrollments`.`status` = 'Ativo'
ORDER BY `tbl_enrollments`.`id` DESC
 LIMIT 1