app/Models/StudentGuardianModel.php

SELECT `tbl_guardians`.*
FROM `tbl_student_guardians`
JOIN `tbl_guardians` ON `tbl_guardians`.`id` = `tbl_student_guardians`.`guardian_id`
WHERE `tbl_student_guardians`.`student_id` = 1
AND `tbl_student_guardians`.`is_authorized` = 1
AND `tbl_guardians`.`is_active` = 1
---
    public function getAuthorizedGuardians($studentId)
    {
        return $this->select('tbl_guardians.*')
            ->join('tbl_guardians', 'tbl_guardians.id = tbl_student_guardians.guardian_id')
            ->where('tbl_student_guardians.student_id', $studentId)
            ->where('tbl_student_guardians.is_authorized', 1)
            ->where('tbl_guardians.is_active', 1)
            ->findAll();