app/Models/UserLogModel.php

SELECT `tbl_user_logs`.*, `tbl_users`.`username`, `tbl_users`.`first_name`, `tbl_users`.`last_name`, `tbl_users`.`photo`
FROM `tbl_user_logs`
LEFT JOIN `tbl_users` ON `tbl_users`.`id` = `tbl_user_logs`.`user_id`
WHERE `tbl_user_logs`.`user_id` = '1'
ORDER BY `tbl_user_logs`.`created_at` DESC
 LIMIT 10
---
    public function getUserLogs($userId = null, $limit = 100)
    {
        $builder = $this->select('tbl_user_logs.*, tbl_users.username, tbl_users.first_name, tbl_users.last_name, tbl_users.photo')
            ->join('tbl_users', 'tbl_users.id = tbl_user_logs.user_id', 'left');

        if ($userId) {
            $builder->where('tbl_user_logs.user_id', $userId);
        }

        return $builder->orderBy('tbl_user_logs.created_at', 'DESC')
            ->limit($limit)
            ->findAll();