app/Views/admin/layouts/sidebar.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_exam_schedules`
WHERE `status` = 'Agendado'
AND `exam_date` >= '2026-02-23'
---
                // Contar exames pendentes (opcional)
                if (has_permission('exams.list')):
                    $examScheduleModel = new \App\Models\ExamScheduleModel();
                    $pendingExams = $examScheduleModel
                        ->where('status', 'Agendado')
                        ->where('exam_date >=', date('Y-m-d'))
                        ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_discipline_averages`
WHERE `status` = 'Recurso'
---
                    <?php
                    if (has_permission('results.view')):
                        $disciplineAvgModel = new \App\Models\DisciplineAverageModel();
                        $appealStudents = $disciplineAvgModel
                            ->where('status', 'Recurso')
                            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_enrollments`
WHERE `final_result` = 'Em Andamento'
AND `status` = 'Ativo'
---
                <?php
                if (has_permission('enrollments.list')):
                    $enrollmentModel = new \App\Models\EnrollmentModel();
                    $pendingRecords = $enrollmentModel
                        ->where('final_result', 'Em Andamento')
                        ->where('status', 'Ativo')
                        ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_documents`
WHERE `is_verified` = 0
AND `tbl_documents`.`deleted_at` IS NULL
---
                <?php
                if (has_permission('documents.list')):
                    $documentModel = new \App\Models\DocumentModel();
                    $pendingDocs = $documentModel->where('is_verified', 0)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_document_requests`
WHERE `status` = 'pending'
---
                <?php
                if (has_permission('document_requests.list')):
                    $requestModel = new \App\Models\DocumentRequestModel();
                    $pendingRequests = $requestModel->where('status', 'pending')->countAllResults();