app/Views/admin/layouts/sidebar.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_courses`
WHERE `is_active` = 1
---
                <i class="fas fa-layer-group"></i> Cursos (Ensino Médio)
                <?php
                $courseModel = new \App\Models\CourseModel();
                $totalCourses = $courseModel->where('is_active', 1)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_exam_schedules`
WHERE `status` = 'Agendado'
AND `exam_date` >= '2026-02-21'
---
                <?php
                // Contar exames pendentes (opcional)
                $examScheduleModel = new \App\Models\ExamScheduleModel();
                $pendingExams = $examScheduleModel
                    ->where('status', 'Agendado')
                    ->where('exam_date >=', date('Y-m-d'))
                    ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_discipline_averages`
WHERE `status` = 'Recurso'
---
                    <i class="fas fa-exclamation-triangle"></i> Exames de Recurso
                    <?php
                    $disciplineAvgModel = new \App\Models\DisciplineAverageModel();
                    $appealStudents = $disciplineAvgModel
                        ->where('status', 'Recurso')
                        ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_enrollments`
WHERE `final_result` = 'Em Andamento'
AND `status` = 'Ativo'
---
                <i class="fas fa-chart-line"></i> Pautas Acadêmicas
                <?php
                $enrollmentModel = new \App\Models\EnrollmentModel();
                $pendingRecords = $enrollmentModel
                    ->where('final_result', 'Em Andamento')
                    ->where('status', 'Ativo')
                    ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_documents`
WHERE `is_verified` = 0
AND `tbl_documents`.`deleted_at` IS NULL
---
                <i class="fas fa-folder-open"></i> Central de Documentos
                <?php
                $documentModel = new \App\Models\DocumentModel();
                $pendingDocs = $documentModel->where('is_verified', 0)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_document_requests`
WHERE `status` = 'pending'
---
                <i class="fas fa-file-pdf"></i> Gerador de Documentos
                <?php
                $requestModel = new \App\Models\DocumentRequestModel();
                $pendingRequests = $requestModel->where('status', 'pending')->countAllResults();